StephaneOwley/FW_STM32WL55_AT_SLAVE_DUAL/CM4/Owley/App/owley_at.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    owley_at.c
  * @author  Owley Team
  * @brief   Header for driver owley_at.c module
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include "owley_at.h"
#include "sigfox_types.h"
#include "st_sigfox_api.h"
#include "usart_if.h"
#include "stm32_tiny_sscanf.h"
#include "app_version.h"
#include "sgfx_eeprom_if.h"
#include "se_nvm.h"
#include "adc_if.h"
#include "sys_app.h"
#include "stm32_seq.h"
#include "utilities_def.h"
#include "mbmuxif_sys.h"
#include "owley_mbwrapper.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* External variables ---------------------------------------------------------*/
/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
#define MN_ON

/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/**
  * @brief Macro to return when an error occurs
  */
#define CHECK_STATUS(status) do {                                                  \
                                  ATEerror_t at_status = translate_status(status); \
                                  if (at_status != AT_OK) { return at_status; }    \
                                } while (0)

/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/

/**

  * @brief  Print n bytes as %02x
  * @param  pt pointer containing the bytes to print
  * @param  n number of bytes
  */
static void print_n(uint8_t *pt, uint32_t n);

/**
  * @brief  Print received n bytes as %02x
  * @param  pt pointer containing the bytes to print
  * @param  n number of bytes
  */
static void print_rx(uint8_t *pt, uint32_t n);

/**
  * @brief  Print an unsigned int
  * @param  value to print
  */
static void print_u(uint32_t value);

/**
  * @brief  get the length and the number of parameters of the string
  * @param  str the string
  * @param  data output vector
  * @param  dataSize length of the output vector
  */
static ErrorStatus stringToData(const char *str, uint8_t *data, uint32_t *dataSize);

/**
  * @brief  Check if character in parameter is alphanumeric
  * @param  Char for the alphanumeric check
  * @retval ERROR or SUCCESS
  */
static ErrorStatus isHex(char Char);

/**
  * @brief  Converts hex string to a nibble ( 0x0X )
  * @param  Char hex string
  * @retval the nibble. Returns 0xF0 in case input was not an hex string (a..f; A..F or 0..9)
  */
static uint8_t Char2Nibble(char Char);

/**
  * @brief  reopens OWLEY and restores radio configuration as from EEPROM
  * @param  sfx_rc region configuration
  * @param  config_words configuration parameters
  * @return sfx_error_t status
  */
static sfx_error_t OWLEY_reopen_and_reconf(sfx_rc_enum_t sfx_rc,  sfx_u32 *config_words);

/**
  * @brief  run testmode 12
  * @note   specific for SE_MON_FDL lib as HW SE do not support public switch key
  * @param  rc_enum region configuration
  * @return sfx_error_t status
  */
static sfx_error_t testmode_12(sfx_rc_enum_t rc_enum);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Exported functions --------------------------------------------------------*/

ATEerror_t AT_return_ok(const char *param)
{
  return AT_OK;
}

ATEerror_t AT_return_error(const char *param)
{
  return AT_ERROR;
}

ATEerror_t AT_reset(const char *param)
{
  /* USER CODE BEGIN AT_reset_1 */

  /* USER CODE END AT_reset_1 */
  NVIC_SystemReset();
  /* USER CODE BEGIN AT_reset_2 */

  /* USER CODE END AT_reset_2 */
}

ATEerror_t AT_restore_factory_settings(const char *param)
{
  /* USER CODE BEGIN AT_restore_factory_settings_1 */

  /* USER CODE END AT_restore_factory_settings_1 */
  E2P_RestoreFs();
  return AT_OK;
  /* USER CODE BEGIN AT_restore_factory_settings_2 */

  /* USER CODE END AT_restore_factory_settings_2 */
}

ATEerror_t AT_SendBit(const char *param)
{
  /* USER CODE BEGIN AT_SendBit_1 */

  /* USER CODE END AT_SendBit_1 */
  uint32_t Bit;
  uint32_t dlFlag = 0;
  uint32_t txRepeat = 1;
  int32_t nbParam;
  uint8_t dl_msg[OWLEY_MAX_DL_PAYLOAD_SIZE] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
  sfx_error_t error;

  nbParam = tiny_sscanf(param, "%u,%u,%d", &Bit, &dlFlag, &txRepeat);

  if (nbParam > 3)
  {
    return AT_PARAM_ERROR;
  }

  if (dlFlag == 0)
  {
    /* no dlFlag */
    error = OWLEY_API_send_bit(Bit, (sfx_u8 *) dl_msg, txRepeat, SFX_FALSE);
    if (error != SFX_ERR_NONE)
    {
      if (error == SFX_ERR_INT_PROCESS_UPLINK_CS_TIMEOUT)
      {
        return AT_TX_TIMEOUT;
      }
      else
      {
        APP_LOG(TS_OFF, VLEVEL_H, "ERROR 0x%04X\r\n", error);
        return AT_LIB_ERROR;
      }
    }
  }
  else
  {
    error = OWLEY_API_send_bit(Bit, (sfx_u8 *) dl_msg, txRepeat, SFX_TRUE);

    if (error == SFX_ERR_NONE)
    {
      print_rx(dl_msg, OWLEY_MAX_DL_PAYLOAD_SIZE * 2);
    }
    else if (error == SFX_ERR_INT_GET_RECEIVED_FRAMES_TIMEOUT)
    {
      return AT_RX_TIMEOUT;
    }
    else
    {
      APP_LOG(TS_OFF, VLEVEL_H, "ERROR 0x%04X\r\n", error);
      return AT_LIB_ERROR;
    }
  }
  return AT_OK;
  /* USER CODE BEGIN AT_SendBit_2 */

  /* USER CODE END AT_SendBit_2 */
}

ATEerror_t AT_SendFrame(const char *param)
{
  /* USER CODE BEGIN AT_SendFrame_1 */

  /* USER CODE END AT_SendFrame_1 */
  uint8_t ul_msg[OWLEY_MAX_UL_PAYLOAD_SIZE] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
  uint8_t dl_msg[OWLEY_MAX_DL_PAYLOAD_SIZE] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
  uint32_t dlFlag = 0;   /* default */
  uint32_t  ul_size = 0;
  uint32_t nbParam;
  uint32_t txRepeat = 1;
  sfx_error_t error;

  /* convert AT param to sgfx param */
  if (stringToData(param, ul_msg, &ul_size) != SUCCESS)
  {
    return AT_PARAM_ERROR;
  }
  if (param[2 * ul_size] == ',')
  {
    nbParam = tiny_sscanf(&param[2 * ul_size + 1], "%u,%u", &dlFlag, &txRepeat);

    if (nbParam > 2)
    {
      return AT_PARAM_ERROR;
    }
  }

