StephaneOwley/FW_STM32WL55_AT_SLAVE_DUAL/CM4/Owley/App/owley_at.c
      if (OWLEY_API_set_std_config(config_words, NA) != SFX_ERR_NONE)
      {
        return AT_ERROR;
      }
    }
    else  if (((param[1] == 'c') || (param[1] == 'C')) && (param[2] == '\0'))
    {
      /* RC3C */
      sfx_u32 config_words[3];

      sfx_rc_enum_t SgfxRcId = SFX_RC3C;
      sfx_rc_t SgfxRc = RC3C;

      E2P_Write_Rc(SgfxRcId);

      E2P_Read_ConfigWords(SgfxRcId, config_words);

      if ((OWLEY_API_close()) != SFX_ERR_NONE)
      {
        return AT_ERROR;
      }
      if ((OWLEY_API_open(&SgfxRc)) != SFX_ERR_NONE)
      {
        return AT_ERROR;
      }

      if (OWLEY_API_set_std_config(config_words, NA) != SFX_ERR_NONE)
      {
        return AT_ERROR;
      }
    }
    else
    {
      return AT_PARAM_ERROR;
    }
  }
  else if (param[0] == '4' && param[1] == '\0')
  {
    sfx_u32 config_words[3];

    sfx_rc_enum_t SgfxRcId = SFX_RC4;
    sfx_rc_t SgfxRc = RC4;

    E2P_Write_Rc(SgfxRcId);

    E2P_Read_ConfigWords(SgfxRcId, config_words);

    if ((OWLEY_API_close()) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
    if ((OWLEY_API_open(&SgfxRc)) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }

    if (OWLEY_API_set_std_config(config_words, RC4_SET_STD_TIMER_ENABLE) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }

  }
  else if (param[0] == '5' && param[1] == '\0')
  {
    sfx_u32 config_words[3];

    sfx_rc_enum_t SgfxRcId = SFX_RC5;
    sfx_rc_t SgfxRc = RC5;

    E2P_Write_Rc(SgfxRcId);

    E2P_Read_ConfigWords(SgfxRcId, config_words);

    if ((OWLEY_API_close()) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
    if ((OWLEY_API_open(&SgfxRc)) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }

    if (OWLEY_API_set_std_config(config_words, NA) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
  }
  else  if (param[0] == '6' && param[1] == '\0')
  {
    sfx_rc_enum_t SgfxRcId = SFX_RC6;
    sfx_rc_t SgfxRc = RC6;

    E2P_Write_Rc(SgfxRcId);

    if ((OWLEY_API_close()) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
    if ((OWLEY_API_open(&SgfxRc
                        )) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }

  }
  else  if (param[0] == '7' && param[1] == '\0')
  {
    sfx_rc_enum_t SgfxRcId = SFX_RC7;
    sfx_rc_t SgfxRc = RC7;

    E2P_Write_Rc(SgfxRcId);

    if ((OWLEY_API_close()) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
    if ((OWLEY_API_open(&SgfxRc
                        )) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }

  }
  else
  {
    return AT_PARAM_ERROR;
  }

  return AT_OK;
  /* USER CODE BEGIN AT_rc_set_2 */

  /* USER CODE END AT_rc_set_2 */
}

ATEerror_t AT_rssi_cal_set(const char *param)
{
  /* USER CODE BEGIN AT_rssi_cal_set_1 */

  /* USER CODE END AT_rssi_cal_set_1 */
  int16_t rssi_cal;
  if (tiny_sscanf(param, "%hd", &rssi_cal) != 1)
  {
    return AT_PARAM_ERROR;
  }

  E2P_Write_RssiCal(rssi_cal);

  return AT_OK;
  /* USER CODE BEGIN AT_rssi_cal_set_2 */

  /* USER CODE END AT_rssi_cal_set_2 */
}

ATEerror_t AT_rssi_cal_get(const char *param)
{
  /* USER CODE BEGIN AT_rssi_cal_get_1 */

  /* USER CODE END AT_rssi_cal_get_1 */
  int16_t rssi_cal =  E2P_Read_RssiCal();
  AT_PRINTF("%d dB\r\n", rssi_cal);

  return AT_OK;
  /* USER CODE BEGIN AT_rssi_cal_get_2 */

  /* USER CODE END AT_rssi_cal_get_2 */
}

ATEerror_t AT_echo_set(const char *param)
{
  /* USER CODE BEGIN AT_echo_set_1 */

  /* USER CODE END AT_echo_set_1 */
  uint32_t echoState;
  if (tiny_sscanf(param, "%u", &echoState) != 1)
  {
    return AT_PARAM_ERROR;
  }

  if (echoState == 0)
  {
    E2P_Write_AtEcho(echoState);
  }
  else if (echoState == 1)
  {
    E2P_Write_AtEcho(echoState);
  }
  else
  {
    return AT_PARAM_ERROR;
  }
  return AT_OK;
  /* USER CODE BEGIN AT_echo_set_2 */

  /* USER CODE END AT_echo_set_2 */
}

ATEerror_t AT_echo_get(const char *param)
{
  /* USER CODE BEGIN AT_echo_get_1 */

  /* USER CODE END AT_echo_get_1 */
  uint32_t echoState = E2P_Read_AtEcho();

  AT_PRINTF("%d\r\n", echoState);
  return AT_OK;
  /* USER CODE BEGIN AT_echo_get_2 */

  /* USER CODE END AT_echo_get_2 */
}

ATEerror_t AT_verbose_set(const char *param)
{
  /* USER CODE BEGIN AT_verbose_set_1 */

  /* USER CODE END AT_verbose_set_1 */
  const char *buf = param;
  int32_t lvl_nb;

  /* read and set the verbose level */
  if (1 != tiny_sscanf(buf, "%u", &lvl_nb))
  {
    AT_PRINTF("AT+VL: verbose level is not well set");
    return AT_PARAM_ERROR;
  }
  if ((lvl_nb > VLEVEL_H) || (lvl_nb < VLEVEL_OFF))
  {
    AT_PRINTF("AT+VL: verbose level out of range => 0(VLEVEL_OFF) to 3(VLEVEL_H)");
    return AT_PARAM_ERROR;
  }

  UTIL_ADV_TRACE_SetVerboseLevel(lvl_nb);
  /*write in eeprom*/
  E2P_Write_VerboseLevel(lvl_nb);

  return AT_OK;
  /* USER CODE BEGIN AT_verbose_set_2 */

  /* USER CODE END AT_verbose_set_2 */
}

ATEerror_t AT_verbose_get(const char *param)
{
  /* USER CODE BEGIN AT_verbose_get_1 */

  /* USER CODE END AT_verbose_get_1 */
  print_u(UTIL_ADV_TRACE_GetVerboseLevel());

  return AT_OK;
  /* USER CODE BEGIN AT_verbose_get_2 */

  /* USER CODE END AT_verbose_get_2 */
}

/* USER CODE BEGIN EF */

/* USER CODE END EF */

/* Private Functions Definition -----------------------------------------------*/

static void print_rx(uint8_t *pt, uint32_t n)
{
  /* USER CODE BEGIN print_rx_1 */

  /* USER CODE END print_rx_1 */
  AT_PRINTF("\r\n+RX=");
  for (int32_t i = 0; i < n; i++)
  {
    AT_PRINTF("%c", pt[i]);
  }
  AT_PRINTF("\r\n");
  /* USER CODE BEGIN print_rx_2 */

  /* USER CODE END print_rx_2 */
}

static void print_n(uint8_t *pt, uint32_t n)
{
  /* USER CODE BEGIN print_n_1 */

  /* USER CODE END print_n_1 */
  for (int32_t i = 0; i < n; i++)
  {
    AT_PRINTF("%c", pt[i]);
  }
  /* USER CODE BEGIN print_n_2 */

  /* USER CODE END print_n_2 */
}

